daily/2022-05-27.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-24 Wed 04:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2022-05-27</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">2022-05-27</h1>

<div id="outline-container-orgb6a7ec4" class="outline-2">
<h2 id="orgb6a7ec4">The Ups and Downs of automated Code Checking Software</h2>
<div class="outline-text-2" id="text-orgb6a7ec4">
<p>
This article is about software that can automatically check that the building is compliant with code (often 100k+ pages) from its design. This requires to be able to do 3 things:
</p>

<ol class="org-ol">
<li>Represent the construction in a computer program;
Medium-sized building may require to label 100k+ parts, which is virtually unfeasible.</li>
<li>Represent the code in a computer program;
Difficult because some statements are ambiguous and are hard to implement as a rule in a computer program (<i>without effort and prior knowledge</i> for instance).</li>
<li>Convince the authorities that if a building passes the automated code check it is compliant with code.
Most projects don't even attempt to do this, even though a system is useless if authorities won't accept its output.</li>
</ol>

<p>
No software does everything, but some tools exist and are recognized for solar installations, and energy code compliance. These three projects, unlike the ones who failed are very narrowly focused. They also did not try to solve any complex technical problems, they are mostly about drop-down menus and textboxes. They ignore problem 1 and 2 to focus on problem 3.
</p>

<blockquote>
<p>
[M]ost new ideas and innovations in the construction industry have been tried, and often much earlier than you might expect. [&#x2026;] A corrolary of this ideas is that if you want to improve the construction industry, you should have at least some idea for why th idea you're considering didn't work previously.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org84aca78" class="outline-2">
<h2 id="org84aca78">Make America Great again</h2>
<div class="outline-text-2" id="text-org84aca78">
<p>
From <i>Faster Please!</i>
</p>

<p>
We can identify two dates where "America started going off rails"
</p>
<ul class="org-ul">
<li>1972 is the end of Project Apollo</li>
<li>1965 is the Immigration and Naturalization Act</li>
</ul>

<p>
The author associates the 1965 landmark with an anti-globalization date; although that's more of a culturalist landmark. Anti-globalization would be the end of Bretton-Woods. Generally, associating people against immigration with people who are against free trade is disingeneous.
</p>
</div>
</div>

<div id="outline-container-orge10b47e" class="outline-2">
<h2 id="orge10b47e">Links to this note</h2>
</div>
</div>
</body>
</html>
